#include <stdio.h>
#include <unistd.h>
#include <stdlib.h>

void process_deal(void)
{
	printf("process_deal\n");
}
int main(void)
{
	
//echo $?查看返回值	
//1-正常终止测试---------------------------------------------------------------------------------
//	exit(-1);			//exit -> _exit
//	return 0;			//return -> exit -> _exit

//2-自杀测试-------------------------------------------------------------------------------------	
	// abort();

//3-扫尾函数测试(进程终止处理函数)-------------------------------------------------------------------------------------	
	atexit(process_deal);		//压栈的方式注册
	exit(0);
}